)PANEL KEYLIST(ISRHLP2,ISR)                                                     
)ATTR DEFAULT() FORMAT(MIX)                                                  
 05 TYPE(PT)                                                                    
 0A TYPE(NT)                                                                    
 26 AREA(SCRL) EXTEND(ON)                                                       
)BODY WINDOW(50,10) CMD()                                                       
       	Concurrant Action Proccing                                           
SAREA38                                                                       
)AREA SAREA38                                                                   
Select this option to allow ESRchfor's batch                                 
processing to exploit Concurrent action                                      
processing if available.  This may help speed                                
up some operations e.g. Retrieve, by running                                 
them in parallel                                                             
)INIT                                                                           
&ZWINTTL = ' '                                                                  
.HHELP = ISP00006                                                               
)END                                                                            
