)PANEL KEYLIST(ISRSPEC,ISR)                                                     
)ATTR DEFAULT() FORMAT(MIX)            /* ISREDDE2 - ENGLISH - 7.1 */        
 0A TYPE(DATAIN) INTENS(LOW) FORMAT(&MIXED) OUTLINE(L)                          
 0B TYPE(DATAIN) INTENS(LOW) CAPS(IN) COLOR(&ZPLEXCLR) FORMAT(&MIXED)           
 0C TYPE(DATAIN) INTENS(LOW) CAPS(OFF) COLOR(&ZPLEXCLR) FORMAT(&MIXED)          
 0F TYPE(DATAIN) INTENS(LOW) CAPS(IN) COLOR(BLUE) FORMAT(&MIXED)                
 0E TYPE(PS)                                                                    
 01 TYPE(DATAOUT) INTENS(LOW)                                                   
 02 TYPE(DATAOUT)                                                               
 03 TYPE(DATAOUT) SKIP(ON)                                                      
 04 TYPE(DATAIN) INTENS(LOW) CAPS(OFF) FORMAT(&MIXED)                           
 05 TYPE(DATAIN) CAPS(OFF) FORMAT(&MIXED)                                       
 06 TYPE(DATAIN) INTENS(LOW) CAPS(IN) FORMAT(&MIXED)                            
 07 TYPE(DATAIN) CAPS(IN) FORMAT(&MIXED)                                        
 08 TYPE(DATAIN) INTENS(LOW) FORMAT(DBCS) OUTLINE(L)                            
 09 TYPE(DATAIN) INTENS(LOW) FORMAT(EBCDIC) OUTLINE(L)                          
 1B TYPE(NEF) PADC(USER)                                                        
 1C TYPE(VOI) PADC(USER)                                                        
 1D TYPE(DATAIN) INTENS(LOW) CAPS(IN) COLOR(BLUE) HILITE(USCORE) FORMAT(&MIXED) 
 13 TYPE(DATAOUT) SKIP(ON) HILITE(USCORE)                                       
 14 TYPE(NT)                                                                    
 18 TYPE(AB)                                                                    
 16 TYPE(DATAIN) INTENS(LOW) CAPS(IN) HILITE(USCORE) FORMAT(&MIXED)             
 17 TYPE(DATAIN) CAPS(IN) HILITE(USCORE) FORMAT(&MIXED)                         
 2A TYPE(ABSL) GE(ON)                                                           
 2B TYPE(PT)                                                                    
 2F TYPE(FP)                                                                    
 20 TYPE(DATAIN) INTENS(LOW) CAPS(IN) FORMAT(&MIXED)                            
 26 AREA(DYNAMIC) EXTEND(ON) SCROLL(ON) USERMOD('20')                           
/* Merged Dynamic Attribute Character codes for EndvHigh & Edit HiLite */       
 U  TYPE(CHAR)               HILITE(USCORE)                                     
/* The following lines only needed for Edit panels */                           
 C  TYPE(CHAR) COLOR(&ZCC)   HILITE(&ZHC)                                       
 D  TYPE(CHAR) COLOR(&ZCD)   HILITE(&ZHD)                                       
 F  TYPE(CHAR) COLOR(&ZCF)   HILITE(&ZHF)                                       
 K  TYPE(CHAR) COLOR(&ZCK)   HILITE(&ZHK)                                       
 O  TYPE(CHAR) COLOR(&ZCO)   HILITE(&ZHO)                                       
 Q  TYPE(CHAR) COLOR(&ZCQ)   HILITE(&ZHQ)                                       
 S  TYPE(CHAR) COLOR(&ZCS)   HILITE(&ZHS)                                       
 V  TYPE(CHAR) COLOR(&ZCV)   HILITE(&ZHV)                                       
 B  TYPE(CHAR) COLOR(BLUE)                                                      
 A  TYPE(CHAR) COLOR(BLUE)   HILITE(REVERSE)                                    
 ?  TYPE(CHAR) COLOR(BLUE)   HILITE(USCORE)                                     
 G  TYPE(CHAR) COLOR(GREEN)                                                     
 H  TYPE(CHAR) COLOR(GREEN)  HILITE(REVERSE)                                    
 P  TYPE(CHAR) COLOR(PINK)                                                      
 Z  TYPE(CHAR) COLOR(PINK)   HILITE(REVERSE)                                    
 L  TYPE(CHAR) COLOR(RED)                                                       
 R  TYPE(CHAR) COLOR(RED)                                                       
 E  TYPE(CHAR) COLOR(RED)    HILITE(REVERSE)                                    
 T  TYPE(CHAR) COLOR(TURQ)                                                      
 N  TYPE(CHAR) COLOR(TURQ)   HILITE(REVERSE)                                    
 W  TYPE(CHAR) COLOR(WHITE)                                                     
 X  TYPE(CHAR) COLOR(WHITE)  HILITE(REVERSE)                                    
 Y  TYPE(CHAR) COLOR(YELLOW)                                                    
 M  TYPE(CHAR) COLOR(YELLOW) HILITE(REVERSE)                                    
   TYPE(NEF)  CAPS(ON) PADC(USER)                                              
)ABC DESC('File') MNEM(1)                                                       
PDC DESC('Save') UNAVAIL(ZEDF) MNEM(1) ACTION RUN(>SAVE)                        
PDC DESC('Cancel') MNEM(1) ACTION RUN(CANCEL)                                   
PDC DESC('Exit') MNEM(1) ACTION RUN(END)                                        
)ABCINIT                                                                        
.ZVARS=EDITFILE                                                                 
   IF (&ZVMODET = 'VIEW') &zedf = 1                                             
   ELSE                   &zedf = 0                                             
)ABC DESC('Edit') MNEM(1)                                                       
PDC DESC('Reset') MNEM(1) ACTION RUN(>RESET)                                    
PDC DESC('Undo') MNEM(1) ACTION RUN(>UNDO)                                      
PDC DESC('Hilite') UNAVAIL(ZEDE) MNEM(1) ACTION RUN(>HI)                        
PDC DESC('Cut') MNEM(1) ACTION RUN(>CUT)                                        
PDC DESC('Paste') MNEM(1) ACTION RUN(>PASTE)                                    
PDC DESC('Find Message First') MNEM(14)                                         
PDC DESC('Find Message Prev') MNEM(14)                                          
PDC DESC('Find Message Next') MNEM(14)                                          
PDC DESC('Find Message Last') MNEM(14)                                          
)ABCINIT                                                                        
.ZVARS=EDITEDIT                                                                 
   IF (&ZEDHI ^= 'YES')  &zede = 1                                              
   ELSE &zede = 0                                                               
)ABCPROC                                                                        
 if (&EDITEDIT EQ '6')        /* Find First */                                  
    &NXCMD ='F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word First'
 if (&EDITEDIT EQ '7')        /* Find First */                                  
    &NXCMD ='F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word prev' 
 if (&EDITEDIT EQ '8')        /* Find First */                                  
    &NXCMD ='F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word next' 
 if (&EDITEDIT EQ '9')        /* Find First */                                  
    &NXCMD ='F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word last' 
)ABC DESC('Edit_Settings') MNEM(2)                                              
PDC DESC('Edit settings') MNEM(1) ACTION RUN(>EDSET)                            
)ABCINIT                                                                        
.ZVARS=PDFCFM                                                                   
)ABC DESC('Menu') MNEM(1)                                                       
PDC DESC('Settings') UNAVAIL(ZPM1) MNEM(1) ACC(CTRL+S)                          
 ACTION RUN(ISRROUTE) PARM('SET')                                               
PDC DESC('View') UNAVAIL(ZPM2) MNEM(1) ACC(CTRL+V)                              
 ACTION RUN(ISRROUTE) PARM('BR1')                                               
PDC DESC('Edit') UNAVAIL(ZPM3) MNEM(1) ACC(CTRL+E)                              
 ACTION RUN(ISRROUTE) PARM('ED1')                                               
PDC DESC('ISPF Command Shell') UNAVAIL(ZPM4) MNEM(6) ACC(CTRL+C)                
 ACTION RUN(ISRROUTE) PARM('C1')                                                
PDC DESC('Dialog Test...') UNAVAIL(ZPM5) MNEM(8) ACC(CTRL+T)                    
 ACTION RUN(ISRROUTE) PARM('DAL')                                               
PDC DESC('Other IBM Products...') UNAVAIL(ZPM6) MNEM(1) ACC(CTRL+O)             
 ACTION RUN(ISRROUTE) PARM('OIB')                                               
PDC DESC('SCLM') UNAVAIL(ZPM7) MNEM(3) ACC(CTRL+L)                              
 ACTION RUN(ISRROUTE) PARM('SCL')                                               
PDC DESC('ISPF Workplace') UNAVAIL(ZPM8) MNEM(6) ACC(CTRL+W)                    
 ACTION RUN(ISRROUTE) PARM('WRK')                                               
PDC DESC('Status Area...') UNAVAIL(ZPMS) MNEM(8) ACC(CTRL+A)                    
 ACTION RUN(ISRROUTE) PARM('SAM')                                               
PDC DESC('Exit') MNEM(2) PDSEP(ON) ACC(CTRL+X) ACTION RUN(EXIT)                 
)ABCINIT                                                                        
.ZVARS=ISR@OPT                                                                  
)ABC DESC('Utilities') MNEM(1)                                                  
PDC DESC('Library') UNAVAIL(ZUT1) MNEM(1) ACC(ALT+1)                            
 ACTION RUN(ISRROUTE) PARM('U1')                                                
PDC DESC('Data set') UNAVAIL(ZUT2) MNEM(1) ACC(ALT+2)                           
 ACTION RUN(ISRROUTE) PARM('U2')                                                
PDC DESC('Move/Copy') UNAVAIL(ZUT3) MNEM(1) ACC(ALT+3)                          
 ACTION RUN(ISRROUTE) PARM('U3')                                                
PDC DESC('Data Set List') UNAVAIL(ZUT4) MNEM(2) ACC(ALT+4)                      
 ACTION RUN(ISRROUTE) PARM('U4')                                                
PDC DESC('Reset Statistics') UNAVAIL(ZUT5) MNEM(5) ACC(ALT+5)                   
 ACTION RUN(ISRROUTE) PARM('U5')                                                
PDC DESC('Hardcopy') UNAVAIL(ZUT6) MNEM(1) ACC(ALT+6)                           
 ACTION RUN(ISRROUTE) PARM('U6')                                                
PDC DESC('Download...') UNAVAIL(ZUTDT) MNEM(2) ACC(ALT+7)                       
 ACTION RUN(ISRROUTE) PARM('UDT')                                               
PDC DESC('Outlist') UNAVAIL(ZUT7) MNEM(2) ACC(ALT+8)                            
 ACTION RUN(ISRROUTE) PARM('U8')                                                
PDC DESC('Commands...') UNAVAIL(ZUT8) MNEM(1) ACC(ALT+9)                        
 ACTION RUN(ISRROUTE) PARM('U9')                                                
PDC DESC('Reserved') UNAVAIL(ZUT9) MNEM(6) ACTION RUN(ISRROUTE) PARM('U10')     
PDC DESC('Format') UNAVAIL(ZUT10) MNEM(1) ACC(ALT+F1)                           
 ACTION RUN(ISRROUTE) PARM('U11')                                               
PDC DESC('SuperC') UNAVAIL(ZUT11) MNEM(1) PDSEP(ON) ACC(CTRL+F2)                
 ACTION RUN(ISRROUTE) PARM('U12')                                               
PDC DESC('SuperCE') UNAVAIL(ZUT12) MNEM(3) ACC(CTRL+F3)                         
 ACTION RUN(ISRROUTE) PARM('U13')                                               
PDC DESC('Search-For') UNAVAIL(ZUT13) MNEM(2) ACC(CTRL+F4)                      
 ACTION RUN(ISRROUTE) PARM('U14')                                               
PDC DESC('Search-ForE') UNAVAIL(ZUT14) MNEM(4) ACC(CTRL+F5)                     
 ACTION RUN(ISRROUTE) PARM('U15')                                               
PDC DESC('Table Utility') UNAVAIL(ZUT15) MNEM(3) ACC(CTRL+F6)                   
 ACTION RUN(ISRROUTE) PARM('U16')                                               
PDC DESC('Directory List') UNAVAIL(ZUT16) MNEM(2) ACC(CTRL+F7)                  
 ACTION RUN(ISRROUTE) PARM('U17')                                               
)ABCINIT                                                                        
.ZVARS=PDFUTIL                                                                  
     &zut9 = '1'                                                                
)ABC DESC('Compilers') MNEM(1)                                                  
PDC DESC('Foreground Compilers') MNEM(1) ACTION RUN(ISRROUTE) PARM('FGD')       
PDC DESC('Background Compilers') MNEM(1) ACTION RUN(ISRROUTE) PARM('BKG')       
PDC DESC('ISPPREP Panel Utility...') MNEM(1) ACTION RUN(ISPPREP)                
PDC DESC('DTL Compiler...') MNEM(1) ACTION RUN(ISPDTLC)                         
)ABCINIT                                                                        
.ZVARS=ISRLANG                                                                  
)ABC DESC('Test') MNEM(1)                                                       
PDC DESC('Functions...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL1') 
PDC DESC('Panels...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL2')    
PDC DESC('Variables...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL3') 
PDC DESC('Tables...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL4')    
PDC DESC('Log') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL5')          
PDC DESC('Services...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL6')  
PDC DESC('Traces...') UNAVAIL(ZPM5) MNEM(2) ACTION RUN(ISRROUTE) PARM('DL7')    
PDC DESC('Break Points...') UNAVAIL(ZPM5) MNEM(1)                               
 ACTION RUN(ISRROUTE) PARM('DL8')                                               
PDC DESC('Dialog Test...') UNAVAIL(ZPM5) MNEM(1)                                
 ACTION RUN(ISRROUTE) PARM('DAL')                                               
PDC DESC('Dialog Test appl ID...') MNEM(2) ACTION RUN(ISRROUTE) PARM('DAP')     
)ABCINIT                                                                        
.ZVARS=DIATEST                                                                  
)ABC DESC('Help') MNEM(1)                                                       
PDC DESC('General') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2A000')                  
PDC DESC('Display screen format') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2E000')    
PDC DESC('Scrolling data') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2F000')           
PDC DESC('Sequence numbering') MNEM(2) ACTION RUN(TUTOR) PARM('ISR2G000')       
PDC DESC('Display modes') MNEM(2) ACTION RUN(TUTOR) PARM('ISR2H000')            
PDC DESC('Tabbing') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2I000')                  
PDC DESC('Automatic recovery') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2J000')       
PDC DESC('Edit profiles') MNEM(6) ACTION RUN(TUTOR) PARM('ISR2K000')            
PDC DESC('Edit line commands') MNEM(6) ACTION RUN(TUTOR) PARM('ISR2L000')       
PDC DESC('Edit primary commands') MNEM(7) ACTION RUN(TUTOR) PARM('ISR2M000')    
PDC DESC('Labels and line ranges') MNEM(3) ACTION RUN(TUTOR) PARM('ISR2Q000')   
PDC DESC('Ending an edit session') MNEM(2) ACTION RUN(TUTOR) PARM('ISR2N000')   
PDC DESC('Appendices') MNEM(8) ACTION RUN(TUTOR) PARM('ISR00004')               
PDC DESC('Index') MNEM(5) ACTION RUN(TUTOR) PARM('ISR91000')                    
)ABCINIT                                                                        
.ZVARS=EDMHELP                                                                  
)BODY  EXPAND(//) WIDTH(&ZWIDTH)  CMD(ZCMD)                                     
 File Edit Edit_Settings Menu Utilities Compilers Test Help           
--/-/------------------------------------------------------------------------- 
Z         Z/ /                                           ColumnsZ    Z    
Command ===>Z/ /                                            Scroll ===>Z   
ZDATA,ZSHADOW/ /                                                              
/ /                                                                           
/ /                                                                           
)INIT                                                                           
.ZVARS = '(ZVMODET ZTITLE ZCL ZCR ZCMD ZSCED)'                                  
&ZHIDEX = 'Y'                                                                   
IF (&ZVMODET = 'VIEW') .HELP = ISR10000  /* DEFAULT TUTORIAL NAME */            
ELSE                   .HELP = ISR20000  /* DEFAULT TUTORIAL NAME */            
&zpm3 = 0                                                                       
VGET (ZSCED) PROFILE        /* Fill Scroll Vars if       */                     
IF (&ZSCED = ' ') &ZSCED = 'PAGE'  /* Blank with page    */                     
&MIXED = TRANS(&ZPDMIX N,EBCDIC *,MIX) /* set mixed format */                   
/* Endevor Hilite Support */                                                    
VGET (EHILITEP) PROFILE     /* Get HiLite Options        */                     
if (&EHILITEP  = '' )       /* nothing set?              */                     
  if (&ZAPPLID  = 'CTLI')   /* Are we in Endevor?        */                     
    &EHILITEP  = '// / 05000'                                                   
  else                      /* default global otherwise  */                     
    &EHILITEP  = '// //05000'                                                   
if (&MsgWords = &Z)         /* check for custom messages */                     
   VGET (MsgWords MsgSever) shared /* are they shared?   */                     
   if (&MsgWords = &Z)      /* still nothing?            */                     
      &MsgWords=' '         /* default to space */                              
      &MsgSever=' '                                                             
      *REXX(MsgWords MsgSever)                                                  
         result = ENDVHIMS(MsgWords "(" MsgSever)                               
         parse value result with MsgWords " ( " MsgSever                        
      *ENDREXX                                                                  
   VPUT (MsgWords MsgSever) shared /* Save values        */                     
/* save current d/s & caller so we can edit if required e.g. VIT or other */    
&EHICALR = &ZPANELID                                                            
vput (ZDSN  ZMEMB ZDSVOL EHICALR) shared                                        
*REXX(EHILITEP EHIMSG EHIFBX EHISBR EHIVED EHIGLB EHIMAX)                       
parse var EHILITEP  EHIMSG +1 EHIFBX +1 EHISBR +1 EHIVED +1 EHIGLB +1 EHIMAX    
*ENDREXX                                                                        
/* init panexit values to max lengths */                                        
*REXX(ZDATA,ZSHADOW,SHADOW,SHATOC,SHAZOM,SHAFAC,ZSCRMAXW,ZSCRMAXD,EHIMAX)       
if length(shadow) < (ZSCRMAXW * ZSCRMAXD) then                                  
   shadow = copies('01'x,(ZSCRMAXW * ZSCRMAXD))                                 
if length(SHAZOM) < ZSCRMAXW then do                                            
   SHAZOM = copies('01'x,ZSCRMAXW)                                              
   SHAFAC = 1                                                                   
end                                                                             
if length(SHATOC) < EHIMAX then                                                 
   SHATOC = OVERLAY('01'x,SHATOC,EHIMAX,1,'01'x) /* max toc length */           
*ENDREXX                                                                        
PANEXIT((ZDATA,ZSHADOW,SHADOW,SHATOC,SHAZOM,SHAFAC,BARFAC,ZWIDTH,ZUSER,         
         ZAPPLID,ZLINES,ZLVLINE,EHILITEP,ZRXRC,ZRXMSG,MsgWords,MsgSever,        
        ),REXX,%ENDVHIGH)                                                       
if (.MSG= &Z AND &ZRXRC = 8)                                                    
   if (&ZRXMSG NE &LASTMSG)                                                     
      .CURSOR = ZCMD                                                            
      .MSG = &ZRXMSG                                                            
      &LASTMSG = &ZRXMSG                                                        
if (&NXCMD NE &Z)                                                               
   &ZCMD = &NXCMD                                                               
   &NXCMD = &Z                                                                  
   .RESP = ENTER                                                                
)REINIT                                                                         
VGET (EHILITEP) PROFILE     /* Get HiLite Options        */                     
*REXX(EHILITEP EHIMSG EHIFBX EHISBR EHIVED EHIGLB EHIMAX)                       
parse var EHILITEP  EHIMSG +1 EHIFBX +1 EHISBR +1 EHIVED +1 EHIGLB +1 EHIMAX    
*ENDREXX                                                                        
PANEXIT((ZDATA,ZSHADOW,SHADOW,SHATOC,SHAZOM,SHAFAC,BARFAC,ZWIDTH,ZUSER,         
         ZAPPLID,ZLINES,ZLVLINE,EHILITEP,ZRXRC,ZRXMSG,MsgWords,MsgSever,        
        ),REXX,%ENDVHIGH)                                                       
if (.MSG= &Z AND &ZRXRC = 8)                                                    
   if (&ZRXMSG NE &LASTMSG)                                                     
      .CURSOR = ZCMD                                                            
      .MSG = &ZRXMSG                                                            
      &LASTMSG = &ZRXMSG                                                        
IF (&ZVMODET = 'VIEW') .HELP = ISR10000  /* DEFAULT TUTORIAL NAME */            
ELSE                   .HELP = ISR20000  /* DEFAULT TUTORIAL NAME */            
REFRESH(*)                                                                      
)PROC                                                                           
if (.resp = END)                                                                
    &SHATOC = ''                                                                
    &SHAZOM = ''                                                                
    &SHAFAC = ''                                                                
    VPUT (SHATOC) SHARED               /* clear any Scanned results */          
&ZCURSOR = .CURSOR                                                              
&ZCSROFF = .CSRPOS                                                              
VPUT (ZSCED) PROFILE                                                            
&ZLVLINE = LVLINE(ZDATA)                                                        
                                                                                
/* Edit Point-n-shoot section                                 */                
if (&CMD = '' AND &ZCURSOR = ZDATA)                                             
   *REXX(ZCMD,ZCSROFF,BARFAC,ZWIDTH,EHISBR,SCANMSGF,ZDATA)                      
   signal on syntax                                                             
   if EHISBR == '/' then                                                        
      if ZCSROFF // ZWIDTH = 0 then do /* Cursor in left margin)    */          
         Locate2 = trunc(((ZCSROFF % ZWIDTH)-1) * BARFAC)                       
         ZCMD = 'Locate' locate2       /* Go there                  */          
         end                                                                    
   if ScanMsgF > 0 then do             /* is there a summary?       */          
      curline = ZCSROFF % ZWIDTH       /* what line is cursor on    */          
      curpfx  = substr(zdata,(curline*zwidth)+2,6)                              
      if curpfx /== '======' then return /* not special             */          
      /* find the start and end of the word the cursor is on        */          
      do i = (ZCSROFF -1) by -1 until pos(substr(zdata,i,1),' (') > 0           
      end                                                                       
      do j = (ZCSROFF +1) by +1 until pos(substr(zdata,j,1),' )') > 0           
      end                                                                       
      Locate2 = substr(zdata,i+1,j-i-1) /* the word we found        */          
      if datatype(locate2,"w") = 0 then return /* not a number      */          
      ZCMD = 'Locate' locate2          /* Go there                  */          
   end                                                                          
   syntax: nop                                                                  
   *ENDREXX                                                                     
/* End of Point-n-shoot section                                     */          
)FIELD                                                                          
FIELD(ZTITLE)                                                                   
FIELD(ZCMD) LEN(255)                                                            
/* Uncomment the following block and COPY/MOVE the sample SHAZOM / FindMsg    */
/* line into the )BODY section if required                                    */
/*                                                                            */
/* SHAZOM       / /                              Find Msg<<<>>>        */
/* )PNTS                                                                      */
/*  FIELD(ZPS00001) VAR(ZCMD)                                                 */
/*    VAL('F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word first')/
/*  FIELD(ZPS00002) VAR(ZCMD)                                                 */
/*    VAL('F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word prev ')/
/*  FIELD(ZPS00003) VAR(ZCMD)                                                 */
/*    VAL('F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word next ')/
/*  FIELD(ZPS00004) VAR(ZCMD)                                                 */
/*    VAL('F RC"çA-ZŸçA-Z0-9Ÿ{3}ç0-9Ÿ{3}ç\SEWCŸ|C1BM4100|BSTPPARS" word last ')/
/*                                                                            */
)END                                                                            
/* This panel based on original provided by IBM */                              
/* 5694-A01     COPYRIGHT IBM CORP 1994, 2011 */                                
/* ISPDTLC Release: 7.1.  Level: PID                                  */        
/* z/OS 02.01.00.  Created - Date: 19 Nov 2014, Time: 18:25           */        
