)PANEL KEYLIST(ISRSPEC,ISR)                                                     
)ATTR DEFAULT() FORMAT(MIX)            /* ISREDDE2 - ENGLISH - 7.1 */        
 21 TYPE(CH)                              /* Column Heading */                  
 18 TYPE(AB)                                                                    
 2A TYPE(ABSL) GE(ON)                                                           
 2B TYPE(PT)                                                                    
 2F TYPE(FP)                              /* Field Prompt */                    
 14 TYPE(NT)                                                                    
 1B TYPE(NEF) PADC(USER)                                                        
 1C TYPE(VOI) PADC(USER)                                                        
 26 AREA(DYNAMIC) EXTEND(ON) SCROLL(ON) USERMOD('20')                           
 01 TYPE(DATAOUT) INTENS(LOW)                                                   
 02 TYPE(DATAOUT)                                                               
 03 TYPE(DATAOUT) SKIP(ON)                                                      
 04 TYPE(DATAIN) INTENS(LOW) CAPS(OFF) FORMAT(&MIXED)                           
 05 TYPE(DATAIN) CAPS(OFF) FORMAT(&MIXED)                                       
 06 TYPE(DATAIN) INTENS(LOW) CAPS(IN) FORMAT(&MIXED)                            
 07 TYPE(DATAIN) CAPS(IN) FORMAT(&MIXED)                                        
 08 TYPE(DATAIN) INTENS(LOW) FORMAT(DBCS) OUTLINE(L)                            
 09 TYPE(DATAIN) INTENS(LOW) FORMAT(EBCDIC) OUTLINE(L)                          
 0A TYPE(DATAIN) INTENS(LOW) FORMAT(&MIXED) OUTLINE(L)                          
 0B TYPE(DATAIN) INTENS(LOW) CAPS(IN) COLOR(&ZPLEXCLR) FORMAT(&MIXED)           
 0C TYPE(DATAIN) INTENS(LOW) CAPS(OFF) COLOR(&ZPLEXCLR) FORMAT(&MIXED)          
 0F TYPE(DATAIN) INTENS(LOW) CAPS(IN) COLOR(BLUE) FORMAT(&MIXED)                
 13 TYPE(DATAOUT) SKIP(ON) HILITE(USCORE)                                       
 16 TYPE(DATAIN) INTENS(LOW) CAPS(IN) HILITE(USCORE) FORMAT(&MIXED)             
 17 TYPE(DATAIN) CAPS(IN) HILITE(USCORE) FORMAT(&MIXED)                         
 1D TYPE(DATAIN) INTENS(LOW) CAPS(IN) COLOR(BLUE) HILITE(USCORE)                
      FORMAT(&MIXED)                                                            
 20 TYPE(DATAIN) INTENS(LOW) CAPS(IN) FORMAT(&MIXED)                            
 B  TYPE(CHAR) COLOR(BLUE)                                                      
 C  TYPE(CHAR) COLOR(&ZCC)    HILITE(&ZHC)                                      
 D  TYPE(CHAR) COLOR(&ZCD)    HILITE(&ZHD)                                      
 E  TYPE(CHAR) COLOR(RED)     HILITE(REVERSE)                                   
 F  TYPE(CHAR) COLOR(&ZCF)    HILITE(&ZHF)                                      
 G  TYPE(CHAR) COLOR(GREEN)                                                     
 H  TYPE(CHAR) COLOR(GREEN)   HILITE(REVERSE)                                   
 I  TYPE(CHAR) COLOR(BLUE)    HILITE(REVERSE)                                   
 J  TYPE(CHAR) COLOR(WHITE)   HILITE(REVERSE)                                   
 K  TYPE(CHAR) COLOR(&ZCK)    HILITE(&ZHK)                                      
 L  TYPE(CHAR) COLOR(RED)                                                       
 M  TYPE(CHAR) COLOR(YELLOW)  HILITE(REVERSE)                                   
 N  TYPE(CHAR) COLOR(TURQ)    HILITE(REVERSE)                                   
 O  TYPE(CHAR) COLOR(&ZCO)    HILITE(&ZHO)                                      
 P  TYPE(CHAR) COLOR(PINK)                                                      
 Q  TYPE(CHAR) COLOR(&ZCQ)    HILITE(&ZHQ)                                      
 R  TYPE(CHAR) COLOR(RED)                                                       
 S  TYPE(CHAR) COLOR(&ZCS)    HILITE(&ZHS)                                      
 T  TYPE(CHAR) COLOR(TURQ)                                                      
 U  TYPE(CHAR)                HILITE(USCORE)                                    
 V  TYPE(CHAR) COLOR(&ZCV)    HILITE(&ZHV)                                      
 W  TYPE(CHAR) COLOR(WHITE)                                                     
 Y  TYPE(CHAR) COLOR(YELLOW)                                                    
 Z  TYPE(CHAR) COLOR(PINK)    HILITE(REVERSE)                                   
 ð  TYPE(NEF) CAPS(ON) PADC(USER)                                               
)ABC DESC('File') MNEM(1)                                                       
PDC DESC('Save') UNAVAIL(ZEDF) MNEM(1) ACTION RUN(>END)                         
PDC DESC('Cancel') MNEM(1) ACTION RUN(CANCEL)                                   
PDC DESC('Refresh') MNEM(1) ACTION RUN(>REFRESH)                                
PDC DESC('Notify...') MNEM(1)                                                   
 ACTION RUN(ISRROUTE) PARM('SELECT CMD(SnapMonN)')                              
PDC DESC('Kill...') MNEM(1)                                                     
 ACTION RUN(ISRROUTE) PARM('SELECT CMD(SnapMonK)')                              
PDC DESC('Settings...') MNEM(3)                                                 
 ACTION RUN(ISRROUTE) PARM('SELECT CMD(SnapMons)')                              
PDC DESC('Exit') MNEM(1) ACTION RUN(END)                                        
)ABCINIT                                                                        
.ZVARS=EDITFILE                                                                 
   IF (&ZVMODET = 'VIEW') &zedf = 1                                             
   ELSE                   &zedf = 0                                             
)ABC DESC('Edit') MNEM(1)                                                       
PDC DESC('Reset') MNEM(1) ACTION RUN(>RESET)                                    
PDC DESC('Undo') MNEM(1) ACTION RUN(>UNDO)                                      
PDC DESC('Hilite') UNAVAIL(ZEDE) MNEM(1) ACTION RUN(>HI)                        
PDC DESC('Cut') MNEM(1) ACTION RUN(>CUT)                                        
PDC DESC('Paste') MNEM(1) ACTION RUN(>PASTE)                                    
)ABCINIT                                                                        
.ZVARS=EDITEDIT                                                                 
   IF (&ZEDHI ^= 'YES')  &zede = 1                                              
   ELSE &zede = 0                                                               
)ABC DESC('Edit_Settings') MNEM(2)                                              
PDC DESC('Edit settings') MNEM(1) ACTION RUN(>EDSET)                            
)ABCINIT                                                                        
.ZVARS=PDFCFM                                                                   
)ABC DESC('Menu') MNEM(1)                                                       
PDC DESC('Settings') UNAVAIL(ZPM1) MNEM(1) ACC(CTRL+S)                          
 ACTION RUN(ISRROUTE) PARM('SET')                                               
PDC DESC('View') UNAVAIL(ZPM2) MNEM(1) ACC(CTRL+V)                              
 ACTION RUN(ISRROUTE) PARM('BR1')                                               
PDC DESC('Edit') UNAVAIL(ZPM3) MNEM(1) ACC(CTRL+E)                              
 ACTION RUN(ISRROUTE) PARM('ED1')                                               
PDC DESC('ISPF Command Shell') UNAVAIL(ZPM4) MNEM(6) ACC(CTRL+C)                
 ACTION RUN(ISRROUTE) PARM('C1')                                                
PDC DESC('Dialog Test...') UNAVAIL(ZPM5) MNEM(8) ACC(CTRL+T)                    
 ACTION RUN(ISRROUTE) PARM('DAL')                                               
PDC DESC('Other IBM Products...') UNAVAIL(ZPM6) MNEM(1) ACC(CTRL+O)             
 ACTION RUN(ISRROUTE) PARM('OIB')                                               
PDC DESC('SCLM') UNAVAIL(ZPM7) MNEM(3) ACC(CTRL+L)                              
 ACTION RUN(ISRROUTE) PARM('SCL')                                               
PDC DESC('ISPF Workplace') UNAVAIL(ZPM8) MNEM(6) ACC(CTRL+W)                    
 ACTION RUN(ISRROUTE) PARM('WRK')                                               
PDC DESC('Status Area...') UNAVAIL(ZPMS) MNEM(8) ACC(CTRL+A)                    
 ACTION RUN(ISRROUTE) PARM('SAM')                                               
PDC DESC('Exit') MNEM(2) PDSEP(ON) ACC(CTRL+X) ACTION RUN(EXIT)                 
)ABCINIT                                                                        
.ZVARS=ISR@OPT                                                                  
)ABC DESC('Utilities') MNEM(1)                                                  
PDC DESC('Library') UNAVAIL(ZUT1) MNEM(1) ACC(ALT+1)                            
 ACTION RUN(ISRROUTE) PARM('U1')                                                
PDC DESC('Data set') UNAVAIL(ZUT2) MNEM(1) ACC(ALT+2)                           
 ACTION RUN(ISRROUTE) PARM('U2')                                                
PDC DESC('Move/Copy') UNAVAIL(ZUT3) MNEM(1) ACC(ALT+3)                          
 ACTION RUN(ISRROUTE) PARM('U3')                                                
PDC DESC('Data Set List') UNAVAIL(ZUT4) MNEM(2) ACC(ALT+4)                      
 ACTION RUN(ISRROUTE) PARM('U4')                                                
PDC DESC('Reset Statistics') UNAVAIL(ZUT5) MNEM(5) ACC(ALT+5)                   
 ACTION RUN(ISRROUTE) PARM('U5')                                                
PDC DESC('Hardcopy') UNAVAIL(ZUT6) MNEM(1) ACC(ALT+6)                           
 ACTION RUN(ISRROUTE) PARM('U6')                                                
PDC DESC('Download...') UNAVAIL(ZUTDT) MNEM(2) ACC(ALT+7)                       
 ACTION RUN(ISRROUTE) PARM('UDT')                                               
PDC DESC('Outlist') UNAVAIL(ZUT7) MNEM(2) ACC(ALT+8)                            
 ACTION RUN(ISRROUTE) PARM('U8')                                                
PDC DESC('Commands...') UNAVAIL(ZUT8) MNEM(1) ACC(ALT+9)                        
 ACTION RUN(ISRROUTE) PARM('U9')                                                
PDC DESC('Reserved') UNAVAIL(ZUT9) MNEM(6) ACTION RUN(ISRROUTE) PARM('U10')     
PDC DESC('Format') UNAVAIL(ZUT10) MNEM(1) ACC(ALT+F1)                           
 ACTION RUN(ISRROUTE) PARM('U11')                                               
PDC DESC('SuperC') UNAVAIL(ZUT11) MNEM(1) PDSEP(ON) ACC(CTRL+F2)                
 ACTION RUN(ISRROUTE) PARM('U12')                                               
PDC DESC('SuperCE') UNAVAIL(ZUT12) MNEM(3) ACC(CTRL+F3)                         
 ACTION RUN(ISRROUTE) PARM('U13')                                               
PDC DESC('Search-For') UNAVAIL(ZUT13) MNEM(2) ACC(CTRL+F4)                      
 ACTION RUN(ISRROUTE) PARM('U14')                                               
PDC DESC('Search-ForE') UNAVAIL(ZUT14) MNEM(4) ACC(CTRL+F5)                     
 ACTION RUN(ISRROUTE) PARM('U15')                                               
PDC DESC('Table Utility') UNAVAIL(ZUT15) MNEM(3) ACC(CTRL+F6)                   
 ACTION RUN(ISRROUTE) PARM('U16')                                               
PDC DESC('Directory List') UNAVAIL(ZUT16) MNEM(2) ACC(CTRL+F7)                  
 ACTION RUN(ISRROUTE) PARM('U17')                                               
)ABCINIT                                                                        
.ZVARS=PDFUTIL                                                                  
     &zut9 = '1'                                                                
)ABC DESC('Compilers') MNEM(1)                                                  
PDC DESC('Foreground Compilers') MNEM(1) ACTION RUN(ISRROUTE) PARM('FGD')       
PDC DESC('Background Compilers') MNEM(1) ACTION RUN(ISRROUTE) PARM('BKG')       
PDC DESC('ISPPREP Panel Utility...') MNEM(1) ACTION RUN(ISPPREP)                
PDC DESC('DTL Compiler...') MNEM(1) ACTION RUN(ISPDTLC)                         
)ABCINIT                                                                        
.ZVARS=ISRLANG                                                                  
)ABC DESC('Test') MNEM(1)                                                       
PDC DESC('Functions...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL1') 
PDC DESC('Panels...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL2')    
PDC DESC('Variables...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL3') 
PDC DESC('Tables...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL4')    
PDC DESC('Log') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL5')          
PDC DESC('Services...') UNAVAIL(ZPM5) MNEM(1) ACTION RUN(ISRROUTE) PARM('DL6')  
PDC DESC('Traces...') UNAVAIL(ZPM5) MNEM(2) ACTION RUN(ISRROUTE) PARM('DL7')    
PDC DESC('Break Points...') UNAVAIL(ZPM5) MNEM(1)                               
 ACTION RUN(ISRROUTE) PARM('DL8')                                               
PDC DESC('Dialog Test...') UNAVAIL(ZPM5) MNEM(1)                                
 ACTION RUN(ISRROUTE) PARM('DAL')                                               
PDC DESC('Dialog Test appl ID...') MNEM(2) ACTION RUN(ISRROUTE) PARM('DAP')     
)ABCINIT                                                                        
.ZVARS=DIATEST                                                                  
)ABC DESC('Help') MNEM(1)                                                       
PDC DESC('General') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2A000')                  
PDC DESC('Display screen format') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2E000')    
PDC DESC('Scrolling data') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2F000')           
PDC DESC('Sequence numbering') MNEM(2) ACTION RUN(TUTOR) PARM('ISR2G000')       
PDC DESC('Display modes') MNEM(2) ACTION RUN(TUTOR) PARM('ISR2H000')            
PDC DESC('Tabbing') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2I000')                  
PDC DESC('Automatic recovery') MNEM(1) ACTION RUN(TUTOR) PARM('ISR2J000')       
PDC DESC('Edit profiles') MNEM(6) ACTION RUN(TUTOR) PARM('ISR2K000')            
PDC DESC('Edit line commands') MNEM(6) ACTION RUN(TUTOR) PARM('ISR2L000')       
PDC DESC('Edit primary commands') MNEM(7) ACTION RUN(TUTOR) PARM('ISR2M000')    
PDC DESC('Labels and line ranges') MNEM(3) ACTION RUN(TUTOR) PARM('ISR2Q000')   
PDC DESC('Ending an edit session') MNEM(2) ACTION RUN(TUTOR) PARM('ISR2N000')   
PDC DESC('Appendices') MNEM(8) ACTION RUN(TUTOR) PARM('ISR00004')               
PDC DESC('Index') MNEM(5) ACTION RUN(TUTOR) PARM('ISR91000')                    
)ABCINIT                                                                        
.ZVARS=EDMHELP                                                                  
)BODY  EXPAND(~~) WIDTH(&ZWIDTH)  CMD(ZCMD)                                     
 File Edit Edit_Settings Menu Utilities Compilers Test Help           
--~-~------------------------------------------------------------------------- 
Z         Z~ ~                                           ColumnsZ    Z    
Command ===>Z~ ~                                            Scroll ===>ðZ   
              ~ ~                                            Hilite ===>ðNHI
Users:Endevor..&UE~ ~Mix:Power Users...&UZ~ ~D/S:Elememnt Catlg Enqs.&DC  
      PDM......&UP~ ~     FDP Users.....&UF~ ~     ACM Root Enqueus....&DA  
      Q/E......&UQ~ ~     Batch Users...&UB~ ~     Package Enqueus.....&DP  
      LongName.&UL~ ~     Remote jobs...&UR~ ~     System Total........&DT  
                                                                               
ZDATA,ZSHADOW~ ~                                                              
~ ~                                                                           
)INIT                                                                           
.ZVARS = '(ZVMODET NTITLE ZCL ZCR ZCMD ZSCED)'                                  
&ZHIDEX = 'Y'                                                                   
/* IF (&ZVMODET = 'VIEW') .HELP = ISR10000  DEFAULT TUTORIAL NAME */            
/* ELSE                   .HELP = ISR20000  DEFAULT TUTORIAL NAME */            
.HELP = SNAPMONT                         /* OverRide for SnapMon  */            
&zpm3 = 0                                                                       
VGET (ZSCED) PROFILE        /* Fill Scroll Vars if       */                     
IF (&ZSCED = ' ') &ZSCED = 'CSR '  /* Blank with Csr     */                     
IF (&NHI = ' ') &NHI = 'YES'  /* Blank with Yes     */                          
&MIXED = TRANS(&ZPDMIX N,EBCDIC *,MIX) /* set mixed format */                   
&SHADOW=&ZSHADOW /* save current Shadow */                                      
PANEXIT((ZDATA,ZSHADOW,ZWIDTH,NHI,FDPDS),REXX,%SNAPMONH)                        
)REINIT                                                                         
&SHADOW=&ZSHADOW /* save current Shadow */                                      
PANEXIT((ZDATA,ZSHADOW,ZWIDTH,NHI,FDPDS),REXX,%SNAPMONH)                        
REFRESH(*)                                                                      
/* IF (&ZVMODET = 'VIEW') .HELP = ISR10000  DEFAULT TUTORIAL NAME */            
/* ELSE                   .HELP = ISR20000  DEFAULT TUTORIAL NAME */            
.HELP = SNAPMONT                         /* OverRide for SnapMon  */            
)PROC                                                                           
REFRESH(*)                                                                      
&ZCURSOR = .CURSOR                                                              
&ZCSROFF = .CSRPOS                                                              
VPUT (ZSCED) PROFILE                                                            
&ZLVLINE = LVLINE(ZDATA)                                                        
&NHI = TRANS(TRUNC(&NHI,1),Y,YES N,No *,No)                                     
IF (&ZCMD = &ZNULL AND .CURSOR = ZSCED)                                         
    &ZCMD = 'Refresh'                                                           
IF (&ZCMD = &ZNULL AND .CURSOR = ZDATA)                                         
   *Rexx (ZCURSOR ZCSROFF ZDATA ZCMD ZWIDTH)                                    
   /*say  ZCURSOR ZCSROFF ZCMD ZWIDTH                                           
     row = ZCSROFF %  ZWIDTH                                                    
     col = ZCSROFF // ZWIDTH                                                    
     say "Row:" row "Col:" col                                                  
     LineNo = SubStr(ZDATA,(row*zwidth)+1,6)                                    
     Say "lineNo:" lineNo.                                                      
     LineNo = SubStr(ZDATA,(row*zwidth)+2,6)                                    
     say "lineNo:" LineNo "LineSf:" LineSf                                      
   */                                                                           
     LineSf = substr(Zdata,(ZCSROFF%ZWIDTH*ZWIDTH)+6,2)                         
     if LineSf /= 90 then exit                                                  
     validChrs = "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789$#@"                      
     Val_Fnd = 0                                                                
     Do Str_Pos = ZCSROFF by -1 to ZCSROFF-8                                    
        if POS(SubStr(ZDATA,Str_POS,1),ValidChrs) > 0 then                      
           Val_Fnd = Val_Fnd+1                                                  
        else                                                                    
           leave                                                                
     end                                                                        
     if Val_fnd = 0 then exit                                                   
     if substr(zdata, Str_pos,1) = '(' then exit /* we're in the flags */       
     Do End_Pos = ZCSROFF+1 by 1 to ZCSROFF+8                                   
        if POS(SubStr(ZDATA,End_POS,1),ValidChrs) > 0 then                      
           Val_Fnd = Val_Fnd+1                                                  
        else                                                                    
           leave                                                                
     end                                                                        
     if Val_fnd = 0 | Val_Fnd > 8 then exit                                     
     ZCMD = 'Find' substr(zdata, Str_pos+1,Val_fnd)                             
   *ENDREXX                                                                     
)FIELD                                                                          
FIELD(ZTITLE)                                                                   
FIELD(ZCMD) LEN(255)                                                            
)END                                                                            
