//*----------------------------------------------------------
//SR2   EXEC PGM=IDCAMS                                      
//SYSIN    DD *                                              
  SET LASTCC=1                                               
//AMSDUMP  DD DUMMY                                          
//SYSPRINT DD DUMMY                                          
