//********************************************************************** 
//* DELETE all members identified as outputs in the component list     * 
//********************************************************************** 
//*                                                                       
//DELCOMP  EXEC PGM=CONDELE,PARM=*COMPONENTS                            
//SYSPRINT DD  SYSOUT=*                                                 
//C1PARM   DD  SYSOUT=*                                                 
//*                                                                    *
//*--------------------------------------------------------------------*