/* rexx */
/*                                                            */
/*  This rexx is an example of the art of the possible        */
/*  in using ACFUNIX interactively                            */
/*                                                            */
/*  Purpose: Provide example of quicly listing of ROLES and   */
/*  all members defined in a role or roles                    */
/*                                                            */
/*  Version 1.0                                               */
/*                                                            */
/*  Broadcom has provided this REXX as an example of the      */
/*  ACFUNIX usage in proving ACF2 command output into a       */
/*  MVS dataset allowing for interactive browse, search or    */
/*  edit of the results from the ACF2 commands.               */
/*                                                            */
/* created by steve hosie NOVEMBER 2025                       */
/*                                                            */
/* examples:                                                  */
/*  TSO LR                                                    */
/*  TSO LR role                                               */
/*  TSO LR SYSADMIN                                           */
/*  TSO LR LIKE(-)                                            */
/*  TSO LR LIKE(SYS-)                                        */
/*                                                            */
/*  Review ACF2 Techdocs on ACFUNIX for more info             */
/*                                                            */
parse arg p1 p2
upper p1 p2
if length(p1) = 0 then
 do
  p1 = 'LIKE(-)'
 end
if length(p2) = 0 then
 sysid_ck = substr(p1,1,5)
else
 sysid_ck = substr(p1,1,5)
if sysid_ck = 'SYSID' then
  do
    acf_cmd = 'MULT SET X(ROL) '||p2
    acf_cmd = acf_cmd||'~list like(-)'
  end
else
  do
    set_x = 'SET X(ROL)'
    acf_cmd = 'mult set x(rol)~list 'p1
  end
current_seconds = TIME(S)
last_qual = "D"current_seconds
user = userid()
udsn = user'.ACF.TEMP.'last_qual
udsn = strip(udsn)
ddname = "A"current_seconds
if sysdsn("'"udsn"'") = OK then
  "alloc f("ddname") da('"udsn"') shr reu"
else
  "alloc f("ddname") da('"udsn"') NEW SP(25 15)
   TR DSORG(PS) RECFM(F B) LRECL(80) BLKSIZE(3120)"
"ACFUNIX -dd "ddname " "acf_cmd
"ISPEXEC EDIT DATASET('"udsn"')"
/* "ISPEXEC BROWSE DATASET('"udsn"')" */
/* "ISPEXEC EDIT DATASET('"udsn"')" */
/*  use above EDIT versus browse if you want to */
 STATUS = MSG('OFF')
"free f("ddname")"
address tso "DELETE '"udsn"'"
s1 ='THANK YOU for using this amazing utility brought to you by'
s1 = s1' Broadcom'
say s1
say ' - Team Collaboration!'
RETURN
