)ATTR DEFAULT() FORMAT(MIX)                                                  
 ^ TYPE(INPUT) CAPS(OFF) JUST(ASIS) PAD(' ')                                    
 _ TYPE(INPUT) CAPS(ON)  JUST(ASIS) PADC(USER)                                  
 ` TYPE(TEXT) SKIP(ON)                                                          
  › TYPE(OUTPUT) INTENS(LOW) CAPS(OFF)                                          
  { TYPE(PT)                /* Panel Title */                                   
  } TYPE(NT)                /* Normal Text */                                   
  % TYPE(FP)                /* Field Prompt - Use for command/scroll text*/     
)BODY WINDOW(65,15) CMD()                                                       
}             {Test4Z Endevor Submit a Unit Test }              }               
}                                                               }               
}Element     ......›EEVETKEL  `                                 }               
}Load  Lib   ......^LOADLIB                                  `  }               
}T4Z load #1 ......^T4ZLOAD1                                 `  }               
}T4Z load #2 ......^T4ZLOAD2                                 `  }               
}                                                               }               
}TSTSUITE(s) ......^TSTSUITE                                 `  }               
}JSON  Lib   ......^JSONLIB                                  `  }               
}Review JCL? ......^Z`                                          }               
}                                                               }               
}ENV:›EEVETKEN}SYS:›EEVETKSY`}SUB:›EEVETKSB`}TYP:›EEVETKTY`    }                
}                                                               }               
}Enter criteria for a batch TEST4Z 'Unit Test' submission.      }               
)INIT                                                                           
 .ZVARS='(SHOWJCL)'                                                             
 .CURSOR = SHOWJCL                                                              
)PROC                                                                           
)END                                                                            
