)SEL &C1BJC1 NE &Z                                                              
&C1BJC1                                                                         
)ENDSEL                                                                         
)SEL &C1BJC2 NE &Z                                                              
&C1BJC2                                                                         
)ENDSEL                                                                         
)SEL &C1BJC3 NE &Z                                                              
&C1BJC3                                                                         
)ENDSEL                                                                         
)SEL &C1BJC4 NE &Z                                                              
&C1BJC4                                                                         
)ENDSEL                                                                         
//*==================================================================*          
//*= A TEST4Z RECORD JOB ============================================*          
//*==================================================================*          
// JCLLIB  ORDER=(&MYJCLLiB)                                                    
//*==================================================================*          
//*--------------------------------------------------------- TST4ZJOB --*       
//* Test4Z Record jcl for :                                                     
//* Env      &EEVETKEN                                                          
//* Sys      &EEVETKSY                                                          
//* Sub      &EEVETKSB                                                          
//* Typ      &EEVETKTY                                                          
//* Stg      &EEVETKSI                                                          
//* ELE      &EEVETKEL                                                          
//*--------------------------------------------------------------------*        
//*   STEP 1 -- Execute TEST4Z program                                          
//*--------------------------------------------------------------------*        
//**JCL from &EEVETKEL \\\\\\ --- Include the JCL step for this pgm ---*        
//   INCLUDE MEMBER=&EEVETKEL                                                   
//**JCL from &EEVETKEL ////// --- Include the JCL step for this pgm ---*        
//STEPLIB  DD DISP=SHR,DSN=Your.TEST4Z.CT4ZLOAD                                 
//         DD DISP=SHR,DSN=&LOADLIB                                             
//*        DD DISP=SHR,DSN=YOUR.V190.STG1.LOADLIB                               
//         DD DISP=SHR,DSN=YOUR.V190.STG1.T4ZLOAD                               
//* Outputs \                                                                   
//ZLDATA   DD DSN=&T4ZLDATA,                                                    
//            DISP=(MOD,CATLG,KEEP),                                            
//            SPACE=(CYL,(1,15)),UNIT=3390,DSNTYPE=LIBRARY,                     
//            DCB=(RECFM=VB,LRECL=32000,BLKSIZE=32004,DSORG=PO)                 
//ZLCOVER  DD DSN=&COVERLIB(&EEVETKEL),                                         
//            DISP=(MOD,CATLG,KEEP),                                            
//            SPACE=(CYL,(1,15)),UNIT=3390,DSNTYPE=LIBRARY,                     
//            DCB=(RECFM=VB,LRECL=132,BLKSIZE=27998,DSORG=PO)                   
//SYSPRINT DD SYSOUT=*                                                          
//*  Inputs \                                                                   
//CEEOPTS  DD *                                                                 
TRAP(ON,NOSPIE)                                                                 
//*--------------------------------------------------------------------*        
//*--------------------------------------------------------------------*        
//*    ADD T4Z outputs into Endevor if appropriate for your site      *         
//*--------------------------------------------------------------------*        
//$$$$$$@  EXEC PGM=NDVRC1,     ** Add the Json into Endv* T4ZRCORD             
//             COND=(4,LT),                                                     
//             DYNAMNBR=1500,                                                   
//             REGION=4096K,                                                    
//             PARM='C1BM3000'                                                  
)IM SCMM@LIB                                                                    
)SEL &VARSILEV = Y                                                              
//*-------------------------------------------------------------------*         
//*  PANVALET AND LIBRARIAN SUPPORT.                                  *         
//*-------------------------------------------------------------------*         
//C1TPDD01 DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1)),                                               
//             DCB=(RECFM=VB,LRECL=260)                                         
//C1TPDD02 DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1)),                                               
//             DCB=(RECFM=VB,LRECL=260)                                         
//C1TPLSIN DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1)),                                               
//             DCB=(RECFM=FB,LRECL=80)                                          
//C1TPLSOU DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1))                                                
//C1PLMSGS DD  SYSOUT=*                                                         
)ENDSEL                                                                         
//*-------------------------------------------------------------------*         
//*  OUTPUT DATA SETS                                                 *         
//*-------------------------------------------------------------------*         
//C1MSGS1  DD SYSOUT=*                                                          
//C1MSGS2  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYMDUMP  DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
)SEL &VCAPYN = Y                                                                
//*********************************************************************         
//*  CONCURRENT ACTION PROCESSING REQUESTED                           *         
//*********************************************************************         
//EN$CAP&VCAPRN DD SYSOUT=*                                                     
)ENDSEL                                                                         
//*-------------------------------------------------------------------*         
//*  CONTROL STATEMENTS                                               *         
//*-------------------------------------------------------------------*         
//BSTIPT01 DD *                                                                 
 ADD ELEMENT '&EEVETKEL'                                                        
     TO ENVIRONMENT '&EEVETKEN'                                                 
        SYSTEM '&EEVETKSY' SUBSYSTEM '&EEVETKSB' TYPE 'T4ZLDATA'                
     FROM DSN '&T4ZLDATA'                                                       
     OPTIONS CCID '&EEVETCCG'                                                   
             COMMENT '&EEVLCOM'                                                 
             UPDATE OVERRIDE SIGNOUT                                            
     .                                                                          
//*-------------------------------------------------------------------*         
