)SEL &C1BJC1 NE &Z                                                              
&C1BJC1                                                                         
)ENDSEL                                                                         
)SEL &C1BJC2 NE &Z                                                              
&C1BJC2                                                                         
)ENDSEL                                                                         
)SEL &C1BJC3 NE &Z                                                              
&C1BJC3                                                                         
)ENDSEL                                                                         
)SEL &C1BJC4 NE &Z                                                              
&C1BJC4                                                                         
)ENDSEL                                                                         
//*==================================================================*          
//*= A TEST4Z Replay JOB ============================================*          
//*==================================================================*          
)IM SCMM@SYM                                                                    
//*--------------------------------------------------------- TST4ZJOB --*       
//* Test4Z Replay jcl for :                                                     
//* Env      &EEVETKEN                                                          
//* Sys      &EEVETKSY                                                          
//* Sub      &EEVETKSB                                                          
//* Typ      &EEVETKTY                                                          
//* Stg      &EEVETKSI                                                          
//* ELE      &EEVETKEL                                                          
//* (Sysouts) SUCCESS / WARNING / FAILURE                                       
//*--------------------------------------------------------------------*        
//*   STEP 1 -- Retrieve T4ZLDATA                                               
//*--------------------------------------------------------------------*        
//*   Retrieve T4ZLDAta into a work TL4Zdata file                     *         
//*--------------------------------------------------------------------*        
//$$$$$$@  EXEC PGM=NDVRC1,     ** Add the Json into Endv* T4ZREPLA             
//             COND=(4,LT),                                                     
//             DYNAMNBR=1500,                                                   
//             REGION=4096K,                                                    
//             PARM='C1BM3000'                                                  
)IM SCMM@LIB                                                                    
)SEL &VARSILEV = Y                                                              
//*-------------------------------------------------------------------*         
//*  PANVALET AND LIBRARIAN SUPPORT.                                  *         
//*-------------------------------------------------------------------*         
//C1TPDD01 DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1)),                                               
//             DCB=(RECFM=VB,LRECL=260)                                         
//C1TPDD02 DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1)),                                               
//             DCB=(RECFM=VB,LRECL=260)                                         
//C1TPLSIN DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1)),                                               
//             DCB=(RECFM=FB,LRECL=80)                                          
//C1TPLSOU DD  UNIT=&T@DISK,                                                    
//             SPACE=(CYL,(1,1))                                                
//C1PLMSGS DD  SYSOUT=*                                                         
)ENDSEL                                                                         
//*-------------------------------------------------------------------*         
//*  OUTPUT DATA SETS                                                 *         
//*-------------------------------------------------------------------*         
//C1MSGS1  DD SYSOUT=*                                                          
//C1MSGS2  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYMDUMP  DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
)SEL &VCAPYN = Y                                                                
//*********************************************************************         
//*  CONCURRENT ACTION PROCESSING REQUESTED                           *         
//*********************************************************************         
//EN$CAP&VCAPRN DD SYSOUT=*                                                     
)ENDSEL                                                                         
//*-------------------------------------------------------------------*         
//*  CONTROL STATEMENTS                                               *         
//*-------------------------------------------------------------------*         
//BSTIPT01 DD *                                                                 
 RETRIEVE ELEMENT &EEVETKEL                                                     
    FROM ENVIRONMENT &EEVETKEN SYSTEM &EEVETKSY SUBSYSTEM &EEVETKSB             
         TYPE T4ZLDATA  STAGE &EEVETKSI                                         
    TO DDNAME 'T4ZLDATA'                                                        
    OPTIONS SEARCH NO SIGNOUT REPLACE.                                          
//T4ZLDATA DD DSN=&T4ZLDATA,                                                    
//            DISP=(MOD,CATLG,KEEP),                                            
//            SPACE=(CYL,(1,15)),UNIT=3390,DSNTYPE=LIBRARY,                     
//            DCB=(RECFM=VB,LRECL=32000,BLKSIZE=32004,DSORG=PO)                 
//*--------------------------------------------------------------------*        
//*   STEP 2 -- Execute TEST4Z program                                          
//*--------------------------------------------------------------------*        
//T4ZRPLAY EXEC PGM=ZTESTEXE    ** Run the T4Z Replay**    T4ZREPLA             
//STEPLIB  DD DISP=SHR,DSN=BST.ENDEVOR.DEVC.CT4ZLOAD                            
//         DD DISP=SHR,DSN=&LOADLIB                                             
//*        DD DISP=SHR,DSN=YOUR.V190.STG1.LOADLIB                               
//         DD DISP=SHR,DSN=YOUR.V190.STG1.T4ZLOAD                               
//* Inputs  \                                                                   
//ZLOPTS   DD *                                                                 
RUN(&EEVETKEL),REPLAY                                                           
COVERAGE,DEEP                                                                   
//CEEOPTS  DD *                                                                 
TRAP(ON,NOSPIE)                                                                 
//ZLDATA   DD DSN=&T4ZLDATA,                                                    
//         DISP=SHR                                                             
//ZLCOVER  DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSOUT1  DD SYSOUT=*                                                          
//ZLMSG    DD DSN=&&&&T4ZLMSG,                                                  
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(1,15)),UNIT=3390,                                     
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=24000,DSORG=PS)                   
//**********************************************************************        
//* Indicate a PASS or FAIL condition onto the Element                          
//**********************************************************************        
//PASSFAIL EXEC PGM=IRXJCL,       **Determine Pass/Fail**  T4ZREPLA             
//         PARM='  '    (null char)                                             
//ZLMSGIN  DD DSN=&&&&T4ZLMSG,DISP=(OLD,DELETE)                                 
//ZLMSG    DD SYSOUT=*                                                          
//SYSEXEC  DD *                                                                 
  $my_rc =3                                                                     
  "EXECIO * DISKR ZLMSGIN  (Stem zmsg. Finis"                                   
  "EXECIO * DISKW ZLMSG    (Stem zmsg. Finis"                                   
  Do j# = 1 to zmsg.0                                                           
     msgtext = zmsg.j#                                                          
     If Pos('Testing passed on',msgtext) /= 0 then,                             
        Do;  Queue msgtext; $my_rc =1; Leave; End                               
  End; /* Do j# = 1 to zmsg.0 */                                                
                                                                                
  if $my_rc =1 then,                                                            
     Queue "Replay Test was successful"                                         
  if $my_rc =3 then,                                                            
     Queue "Test Failed"                                                        
  If Allow_test_fails = 'Y' then,                                               
     Do; Queue "The Allow_test_fails = 'Y' is set"; $my_rc =2 ; End             
                                                                                
  MessageDD  = Word("SUCCESS WARNING FAILURE",$my_rc)                           
  Call BPXWDYN "ALLOC DD("MessageDD") SYSOUT(A) "                               
  "EXECIO " QUEUED() "DISKW" MessageDD "( Finis"                                
  CALL BPXWDYN "Free  DD("MessageDD")"                                          
  if $my_rc =3 then $my_rc =8                                                   
                                                                                
  exit($my_rc)                                                                  
//SYSTSIN  DD DUMMY                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------*        
//**********************************************************************        
