//*  ** YOURSITE.NDVR.TEAM.JCL.TEST4Z(ZTP1HELO)                                 
//INPUTS DD *            ** Unique Input for ZTP1HELO **                        
Chandru                                                                         
Olga                                                                            
Joseph                                                                          
PavanKumar                                                                      
Purusottam                                                                      
Richard                                                                         
Selvam                                                                          
//MESSAGES DD SYSOUT=*   ** Unique Output messages for for ZTP1HELO **          
//*----------------------------------------------------------                   
