//*  ** YOURSITE.NDVR.TEAM.JCL.TEST4Z(ZTPQHELO)                                 
//SYSIN1 DD *                                                                   
Vamsy                                                                           
Ashwin                                                                          
David                                                                           
PavanKumar                                                                      
Purusottam                                                                      
Richard                                                                         
Selvam                                                                          
//SYSOUT1  DD SYSOUT=*                                                          
//*----------------------------------------------------------                   
