/* rexx */                                                      
ADDRESS ISPEXEC "SELECT PANEL(ISR@PRIM)"                        
EXIT                                                            
