//SYSEXEC  DD DISP=SHR,DSN=SYS3.ENDV.ELIB.ADMTEST.SSC2.REXX  SCMM@REX          
//SYSTSPRT DD SYSOUT=*                                                          
