//SYSEXEC  DD DISP=SHR,DSN=GONJO08.CNTL.SOURCE                                  
//         DD DISP=SHR,DSN=CADEMO.ENDV.PRCS.ADMTEST.REXXEXEC                    
//SYSTSPRT DD SYSOUT=*                                                          
