//SYSEXEC  DD DISP=SHR,DSN=GONJO08.CNTL.SOURCE             SCMM@REX             
//         DD DISP=SHR,DSN=CADEMO.ENDV.PRCS.ADMTEST.REXXEXEC                    
//SYSTSPRT DD SYSOUT=*                                                          
