//WALJO11T JOB  (301000000),'DAN-WALTHER',CLASS=A,PRTY=6,    
//  MSGCLASS=X,USER=WALJO11,REGION=7M,NOTIFY=&SYSUID         
//*----------------------------------------------------------
//SR2   EXEC PGM=IDCAMS                                      
//SYSIN    DD *                                              
  SET LASTCC=1                                               
//AMSDUMP  DD DUMMY                                          
//SYSPRINT DD DUMMY                                          